app/controllers/sessions_controller.rb

  def oauth
    @user = User.where(
      email: omniauth_options[:email]
    ).first_or_initialize(omniauth_options)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "rileymjones@gmail.com"]]

  def create
    auth = request.env['omniauth.auth']
    # Find an identity here
    @identity = Identity.find_with_omniauth(auth)

    if @identity.nil?
      # If no identity was found, create a brand new one here
      @identity = Identity.create_with_omniauth(auth)
    end

    if signed_in?
      if @identity.user == current_user
        # User is signed in so they are trying to link an identity with their
        # account. But we found the identity and the user associated with it
        # is the current user. So the identity is already associated with
        # this user. So let's display an error message.
        redirect_to root_url, notice: "Already linked that account!"
      else
        # The identity is not associated with the current_user so lets
        # associate the identity
        @identity.user = current_user
        @identity.save()
        redirect_to root_url, notice: "Successfully linked that account!"
      end
    else
      if @identity.user.present?
---
INSERT INTO "identities" ("uid", "provider", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["uid", "129111212"], ["provider", "twitter"], ["created_at", "2015-11-30 14:38:46.299641"], ["updated_at", "2015-11-30 14:38:46.299641"]]
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1