app/controllers/sites_controller.rb

  def index
    @sites = Site.all
---
SELECT "sites".* FROM "sites"

  def create
    @site = Site.new(site_params)

    respond_to do |format|
      if @site.save
---
INSERT INTO "sites" ("url", "created_at", "updated_at") VALUES (?, ?, ?)  [["url", "google.com"], ["created_at", "2015-11-20 21:09:03.986138"], ["updated_at", "2015-11-20 21:09:03.986138"]]

    def set_site
      @site = Site.find(params[:id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = ? LIMIT 1  [["id", 1]]